""" 

Додаткове завдання на 4 тиждень
Умова
Написати програму яка буде очікувати від користувача ввести прізвище, ім`я, вік, стаж, зарплату, після того як користувач ввів дані - вивести таблицю з даними і дати можливість користувачу вибрати поле по яку можна соритувати дані. Додати валідацію даних через обробку виключень.
Вимоги
написати три функції - перша очікує від користувача дані, тобто питає користувача що робити: Вийти, ввести новий запис, показати вже введені записи, посортувати дані
Якщо користувач ввів невірну команду - кидати ValueError помилку але в місці де ця функція викликається обробити цю помилку та вивести повідомлення - невірна команда
Якшо користувач ввів Вийти - закрити програму
Якщо користувач ввів Ввести дані - запустити другу функцію яка буде очікувати від користувача дані про працівника, Прізвище та імя мають містити тільки літери, вік, зарплата, стаж тільки цифри, причому стаж не може бути більшим за вік, вік не можу бути більшим за 150 - якщо перевірка не пройшла - райзати ValueError з відповідним повідомленням
Функція 2 повертає словник з даними про працівника
Функція 1 додає словник до списку таким чином, функція 1 тримає список словників, тому якщо користувач вибере пункт сортувати дані, потрібно дати користувачу вибрати по якому полю можна сортувати (вивести список доступних ключів) і посортувати по вибраному полю
Після кожного введеня даних обовёязково питати користувача що робити далі
Якщо користувач вибере показати дані, запустити функцію 3 яка буде виводити спсиок діктів як табличку
#################################
#  First Name     # Last Name # Age # ...
#################################
# Хтось              # Десь           #         #
Причому колонка має бути однієї дожини з відступати мінімум один символ від країв і брати дожина по найдовшому значенню в колонці

"""

