"""
Додаткове завдання:
Дано json file product.json в форматі
[{
'id': int
'product': str
'count': int
'price': int
'status': str(one of 'купити, 'куплено')
'comment': str
}]
people.json
[{
'id': int
'first_name': str,
'last_name': str,
'wallet': int
'shopping_list': [int, int]
}]
Написати класи
class Product
product: ім'я продукту
count: 10 кількість продуктів
price: ціна одиниці товару
status: Стрічка яка містить один з елеметів 'купити, 'куплено', ''
comment: коментар до продукту
class Person який містить
id - унікальний id людини
first_name - ім'я
last_name - прізвище
wallet - 100 - кількість грошей в гаманці
shopping_list = список продуктів які треба купити список екземплярів класу продакт
Написати програму
Яка буде дозволяти:
також програма має дозволяти зчитувати,додавати товари
зчитувати користувачів, додавати чи видаляти вказуючи дані про нього та вказати кількість грошей в гаманці також додавати або забирати продукти в списоку покупок.
при зчитуванні файлів потрібно додати валідацію чи дані відповідають потрібним типам
shopping_list повинен містити тільки id продуктів які існують
при створенні екземплярів класів брати продукт по id
при спробі купити товарів на суму якої не достатньо (грошей потрібно більше ніж є в гаманці) генерувари виключну ситуацію NotEnoughMoneyException де вказувати скільки грошей недостатньо
всі дії потрібно робити в порядку
зчитати файл продуктів
згенерувати список екземплярів класу Product
зчитати файли людей
згенерувати список екземплярів класу Person та вибрати з списоку продуктів продукти по id
якщо виникла помилка читання чи генерування файлів - ігнорувати
показати меню де можна вибрати
показати всіх людей та список їх покупок
список всі продуктів
пошук людей по імені
додати нову людину (id має бути згенеровано автоматично додавши до найбільшого id 1)
додати новий продукт(id має бути згенеровано автоматично додавши до найбільшого id 1)
додати продукт до списку покупок пеної людини по id (один продукт може бути в однієї людини)
купити всі продукти в списку певної людини(якшо виникла виключна ситуацію показати повідомлення що не можливо виконати купівлю). Враховувати треба тільки ті продукти які в статусі купити. Зменшити розмір гаманця на ціну товару
поповнити гаманець певної людини
вийти
при виході з програми зберегти всі дані з екземплярів власів в відповідні json файли зберігаючи формат
white_check_mark
eyes
raised_hands

результати кидати мені в приватні повідомлення у вигляді файлу або використовуючи сервіси github

"""